Rails/Proyecto AS/Arquitectura/app/controllers/peticions_controller.rb

  def index
    @peticions = Peticion.all
---
SELECT "peticions".* FROM "peticions"

  def create
    @peticion = Peticion.new(peticion_params)

    respond_to do |format|
      if @peticion.save
---
INSERT INTO "peticions" ("Tipo_de_documento", "Nombre", "Apellido", "Direccion", "Correo", "Pais", "ciudad", "tipoSolicitud", "Detalle", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @peticion.destroy
---
DELETE FROM "peticions" WHERE "peticions"."id" = ?  [["id", 1]]

    def set_peticion
      @peticion = Peticion.find(params[:id])
---
SELECT  "peticions".* FROM "peticions" WHERE "peticions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]